// array.js
export const questions = [
  {
    id: 'q1',
    question: 'สาร _______ ในบุหรี่ไฟฟ้าจะเพิ่มการหลั่งโดปามีนในสมอง ทําให้เกิดการเสพติด',
    correctAnswer: "นิโคติน",
    score : 1
  },
  {
    id: 'q2',
    question: 'นิโคตินมีผลต่อเด็กและวัยรุ่นอย่างไร?',
    correctAnswer: "สมอง",
    score : 1
  },
  {
    id: 'q3',
    question: 'อาการปอดที่ระคายเคืองจากสารปรุงแต่งกลิ่นรสชาติเรียกว่า _______',
    correctAnswer: "ป๊อปคอร์น ลัง",
    score : 1
  }
];

export const questions2 = [
    {
        id: 'q1', question: 'คุณจะไปเล่นบอลกับเพื่อนหรือไม่?', video: 'video1.mp4', options:
            [{ text: '• ขอบใจน่ะ เราจะไปเล่นบอลอะ เพื่อนๆเรารออยู่ นายจะตามไปด้วยก็ได้นะ', score: 0 }, { text: '• ไม่เอาดีกว่า ไม่เห็นจะเท่ตรงไหนเลย', score: 1 }]
    },
    {
        id: 'q2', question: 'คุณออกกำลังกายสม่ำเสมอไหม?', video: 'video2.mp4', options:
            [{ text: '• ไม่ดีกว่า บ้านเราไม่มีใครสูบบุหรี่ พ่อกับแม่ก็ไม่ชอบให้สูบ ช่วงนี้เขามีการรณรงค์ให้เลิกสูบบุหรี่กันแล้วนะ', score: 1 }, { text: '• ไม่อ่ะ พวกนายเก็บไว้สูบเองเถอะ', score: 0 }]
    },
    {
        id: 'q3', question: 'เมื่อถูกเพื่อนถามเซ้าซี้ต่อ คุณจะทําอย่างไร', video: 'video3.mp4', options:
            [{ text: '• ไม่อะยังไงเราก็ไม่ลอง พร้อมกับเดินออกไปจากเพื่อนทันที', score: 1 }, { text: '• ลองสูบตามที่เพื่อนบอก', score: 0 }]
    },
    {
        id: 'q4', question: 'ถ้าเพื่อนสนิทชวนให้ลองสูบบุหรี่ จะทําอย่างไร?', options:
            [{ text: '• แค่ลอง...ไม่เป็นไรหรอกมั้ง', score: 0 }, { text: '• ไม่ดีกว่า...เราว่าไปเตะบอลกันเถอะ', score: 1 }]

    },
    {
        id: 'q5', question: 'เพื่อนกลุ่มหนึ่งที่กําลังสูบบุหรี่อยู่หลังอาคารเรียนตะโกนเรียกให้เข้าไปหา', options:
            [{ text: '• เดินเข้าไปถามเพื่อนว่ามีอะไรหรือเปล่า', score: 0 }, { text: '• ตะโกนบอกไปว่า "เดี๋ยวค่อยคุยกันนะ พอดีเรากําลังจะไปห้องสมุด"', score: 1 }]
    }];