// array.js
export const questions = [
  {
    id: 'q3',
    question: 'สาร _______ ในบุหรี่ไฟฟ้าจะเพิ่มการหลั่งโดปามีนในสมอง ทําให้เกิดการเสพติด',
    options: [
      { text: '• นิโคติน', score: 1 }, // ถูก
      { text: '• โคเคน', score: 0 },
      { text: '• ฝิ่น', score: 0 },
    
    ]
  },
  {
    id: 'q2',
    question: 'นิโคตินมีผลต่อเด็กและวัยรุ่นอย่างไร?',
    options: [
      { text: '• ทําให้ปอดทํางานดีขึ้น', score: 0 }, // ถูก
      { text: '• ส่งผลต่อพัฒนาการทางสมอง', score: 1 },
      { text: '• ลดความดันโลหิต', score: 0 },
      { text: '• ช่วยให้หัวใจแข็งแรง', score: 0 }
    ]
  },
  {
    id: 'q3',
    question: 'อาการปอดที่ระคายเคืองจากสารปรุงแต่งกลิ่นรสชาติเรียกว่า _______',
    options: [
      { text: '• ลัง ป๊อปคอร์น', score: 0 }, // ถูก
      { text: '• ป๊อปคอร์น ลัง', score: 1 },
      { text: '• คอร์นป๊อป ลัง', score: 0 }
    ]
  }
];
