// array.js
export const questions = [
  {
    id: 'q1', question: 'สาร _______ ในบุหรี่ไฟฟ้าจะเพิ่มการหลั่งโดปามีนในสมอง ทําให้เกิดการเสพติดลกับเพื่อนหรือไม่?', options:
      [{ text: 'นิโคติน', score: 1 }, { text: 'โคเคน', score: 0 }, { text: 'ฝิ่น', score: 0 }]
  },
  {
    id: 'q2', question: 'นิโคตินมีผลต่อเด็กและวัยรุ่นอย่างไร', options:
      [{ text: 'ทําให้ปอดทํางานดีขึ้น', score: 0 }, { text: 'ส่งผลต่อพัฒนาการทางสมอง', score: 1 }, { text: 'ลดความดันโลหิต', score: 0 }, { text: 'ช่วยให้หัวใจแข็งแรง', score: 0 }]
  },
  {
    id: 'q3',
    question: 'อาการปอดที่ระคายเคืองจากสารปรุงแต่งกลิ่นรสชาติเรียกว่า _______',
    correctAnswer: "ป๊อปคอร์น ลัง",
    score: 1
  }
];

export const questions2 = [
  {
    id: 'q1', video: '/public/img/2_1.mp4', options:
      [{ text: '• ขอบใจนะ เราจะไปเล่นแบดน่ะ เพื่อนๆเรารออยู่ พวกเธอจะตามไปด้วยก็ได้นะ', score: 1 }, { text: '• น่าสนใจจัง', score: 0 }]
  },
  {
    id: 'q2', video: '/public/img/2_2.mp4', options:
      [{ text: '• ไม่ดีกว่า บ้านเราไม่มีใครสูบบุหรี่ พ่อกับแม่ก็ไม่ชอบให้สูบ ช่วงนี้เขามีการรณรงค์ให้เลิกสูบบุหรี่กันแล้วนะ', score: 1 }, { text: '• ลองสักหน่อยก็ได้', score: 0 }]
  },
  {
    id: 'q3', video: '/public/img/2_3.mp4', options:
      [{ text: '• ไม่เอาหรอก เราไม่ชอบกลิ่นบุหรี่เลย หวังว่าเธอจะเข้าใจนะ', score: 1 }, { text: '• เพื่อนตื๊อแบบนี้ลองก็ได้', score: 0 }]
  },
  {
    id: 'q4', video: '/public/img/2_4.mp4', options:
      [{ text: '• ไม่อะยังไงเราก็ไม่ลอง พร้อมกับเดินออกไปจากเพื่อนทันที', score: 1 }, { text: '• ลองสูบตามที่เพื่อนบอก', score: 0 }]
  },
  {
    id: 'q5', video: '/public/img/2_5.mp4', question: 'ถ้าเพื่อนสนิทชวนให้ลองสูบบุหรี่ จะทําอย่างไร?', options:
      [{ text: '• แค่ลอง...ไม่เป็นไรหรอกมั้ง', score: 0 }, { text: '• ไม่ดีกว่า...เราว่าไปเตะบอลกันเถอะ', score: 1 }]

  }];

export const questions3 = [
  {
    id: 'q1', video: '/public/img/1.1.mp4', options:
      [{ text: '• ไม่เอาดีกว่า ตั้งใจซ้อมมาหลายอาทิตย์แล้วไม่อยากพังเพราะแค่นี้', score: 1 }, { text: '• ถ้าลองแล้วได้เข้าทีม งั้นลองสักหน่อยก็ได้', score: 0 }]
  },
  {
    id: 'q2', video: '/public/img/1.2.mp4', options:
      [{ text: '• ไม่ใช่บุหรี่ทั่วไป....คงไม่เป็นไรมั้ง ลองดู', score: 0 }, { text: '• เราสุขภาพไม่ค่อยดีเป็นภูมิแพ้ไม่สูบดีกว่าไม่อยากเป็นภาระของพ่อแม่ตอนป่วย', score: 1 }]
  },
  {
    id: 'q3', options:
      [{ text: '• ปฏิเสธไปว่า "ขอบคุณครับพี่ แต่ผมไม่ชอบกลิ่นมันเลย ได้กลิ่นแล้วเวียนหัว', score: 1 }, { text: '• ลองดูก็ได้...เกรงใจรุ่นพี่', score: 0 }]
  },
  {
    id: 'q4', video: '/public/img/2.1.mp4', options:
      [{ text: '• คนละไม่กี่บาท...ลองดูก็ได้', score: 0 }, { text: '• เราซื้อไม่ได้หรอก พ่อแม่จํากัดเงินมา ถ้าหายไปจะผิดสังเกต', score: 1 }]

  },
  {
    id: 'q5', video: '/public/img/2.2.mp4', options:
      [{ text: '• ไม่ล่ะ แม่บอกห้ามยุ่งกับยาเสพติดเด็ดขาดและเราก็ไม่อยากทําผิดกฎ', score: 1 }, { text: '• ลองสูบดูก็ได้บุหรี่ไฟฟ้าไม่มีควัน ไม่น่ามีปัญหา', score: 0 }]
  },
  {
    id: 'q6', video: '/public/img/3.1.mp4', options:
      [{ text: '• ไม่เอาล่ะ สูบบุหรี่ไม่ดีต่อสุขภาพนะเราไปหากิจกรรมคลายเครียดดีกว่า', score: 0 }, { text: '• กลิ่นองุ่นหรอ น่าลองจัง', score: 0 }]
  }];


export const questions4 = [
  {
    id: 'q1', video: '/public/img/4.1.mp4', options:
      [{ text: '• “ไม่อะ เดี๋ยวชุดนักเรียนเหม็นกลับบ้านพ่อแม่รู้”', score: 1 }, { text: '• “ไม่ดีกว่า ไปกินนํ้าเย็นๆ กันเถอะ” ', score: 0 }]
  },
  {
    id: 'q2', img: '/public/img/a.png', question: 'เมื่อเพื่อนพูดถึงไอดอลนักดนตรีขาร็อกที่สูบบุหรี่แล้วเท่มากแล้วชวนเราสูบจะได้เท่อย่างพี่เขาบ้าง ตอบเพื่อนว่าอย่างไร', options:
      [{ text: '• พี่นักร้องอีกคนไม่สูบบุหรี่นะ เราว่าเขาเท่กว่ามากๆ เลยมีชื่อเสียงประสบความสําเร็จ และมีอนาคตที่ดีด้วย', score: 1 }, { text: '• เท่จริงๆ ด้วย สูบก็ได้...เราอยากเท่เหมือนพี่เขาบ้าง', score: 0 }]
  },
  {
    id: 'q3', img: '/public/img/b.png', question: 'เปิดเทอมใหม่ เจอเพื่อนใหม่ชวนสูบบุหรี่ตอบเพื่อนไปว่าอย่างไร', options:
      [{ text: '• ถ้าเราไม่สูบ จะเป็นเพื่อนกับนายไม่ได้เหรอเราว่ามันไม่เกี่ยวกันนะ', score: 1 }, { text: '• ยอมสูบเพื่อผูกมิตรกับเพื่อนใหม่', score: 0 }]
  },
  {
    id: 'q4', img: '/public/img/c.png', question: 'ไปเที่ยวบ้านเพื่อนช่วงวันหยุด เพื่อนชวนแอบสูบบุหรี่ในห้อง จะตอบว่าอย่างไร', options:
      [{ text: '• ไม่ล่ะ เราขอเล่นเกมใหม่ของนายละกัน สนุกกว่า', score: 1 }, { text: '• ไม่ล่ะ เราขอเล่นเกมใหม่ของนายละกัน สนุกกว่า', score: 0 }]

  },
  {
    id: 'q5', img: '/public/img/e.png', question: 'เห็นรุ่นน้องแอบสูบบุหรี่ในห้องนํ้าโรงเรียนแถมยังยื่นบุหรี่ให้เราสูบเป็นเพื่อนด้วย', options:
      [{ text: '• ไม่ละน้อง ขอบใจ พี่ไม่สูบหรอก มันไม่ดีต่อสุขภาพลุงข้างบ้านพี่เพิ่งป่วยเป็นมะเร็งปอดเพราะสูบบุหรีนี่แหละ', score: 1 }, { text: '• สูบเป็นเพื่อนน้องสักนิดก็ได้', score: 0 }]
  },
  {
    id: 'q6', img: '/public/img/f.png', question: 'ไปงานวันเกิดเพื่อนรุ่นพี่แล้วถูกชักชวนให้ลองสูบบุหรี่', options:
      [{ text: '• ลองสูบสักครั้ง ถือเป็นของขวัญวันเกิดให้รุ่นพี', score: 0 }, { text: '• ไว้คราวหน้าแล้วกันนะครับพี่ ตอนนี้ผมยังไม่พร้อมเลย ต้องรีบกลับบ้านแล้วด้วยครับ', score: 1 }]
  }];
